// ------------------------------------------------------------
//  - 4 / 1 -
// ------------------------------------------------------------
// 중간고사 4/24 목
// 과제 4/10 과제설명
// ---------------------------------------
// callable types - 호출 가능한 타입
// 1. 함수
// 2. 함수 포인터
// 3. 람다 - 이름없는 함수 (프로그래머가 부를 일이 없기때문에 이름이 없다)
// ------------------------------------------------------------

#include <iostream>

#include "save.h"
using namespace std;

class 람다 {
public:
	void operator()() { cout << "난 람다야" << endl; };
};

//--------
int main()
//--------
{
	

	람다 a{};

	a();

	cout << typeid(a).name() << endl;

	//save("main.cpp");
	
	
}